//
//  main.m
//  Objective-C线性表顺序结构
//
//  Created by Lix on 16/3/20.
//  Copyright © 2016年 Lix. All rights reserved.
//

#import <Foundation/Foundation.h>
#import "List.h"
int main(int argc, const char * argv[]) {
    @autoreleasepool {
        //把1-5按顺序入栈
        SqList * list = initSqList();

        NSLog(@"把1-5按顺序入栈");
        int j = 1;
        for (int i = 0; i <8  ; i++) {
            pushElement(j, list);
            ++j;
        }
        
        
        
        displayList(list);

        //往第三个位置插入724;
        
        insertElementWithLocation(724, list, 8);
        
        //按照栈的形式来删除数据
//        popElement(0, list);
        
        //把第五位的数据删除
//        deleteElementWithLocation(0, 5, list);
        
        displayList(list);
        
    }
    return 0;
}

//原始数据
//***************************
//数值 = 1 , 地址 = 0x1002014d0
//数值 = 2 , 地址 = 0x1002014d4
//数值 = 3 , 地址 = 0x1002014d8
//数值 = 4 , 地址 = 0x1002014dc
//数值 = 6 , 地址 = 0x1002014e0
//数值 = 7 , 地址 = 0x1002014e4
//数值 = 8 , 地址 = 0x1002014e8
//***************************

//删除第五位
//***************************
//数值 = 1 , 地址 = 0x1002014d0
//数值 = 2 , 地址 = 0x1002014d4
//数值 = 3 , 地址 = 0x1002014d8
//数值 = 4 , 地址 = 0x1002014dc
//数值 = 6 , 地址 = 0x1002014e0
//数值 = 7 , 地址 = 0x1002014e4
//数值 = 8 , 地址 = 0x1002014e8
//***************************

//第八位增加724
//***************************
//数值 = 1 , 地址 = 0x100101320
//数值 = 2 , 地址 = 0x100101324
//数值 = 3 , 地址 = 0x100101328
//数值 = 4 , 地址 = 0x10010132c
//数值 = 5 , 地址 = 0x100101330
//数值 = 6 , 地址 = 0x100101334
//数值 = 7 , 地址 = 0x100101338
//数值 = 724 , 地址 = 0x10010133c
//数值 = 8 , 地址 = 0x100101340
//***************************
